org/git-workflow-stepbystep-guides.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-06-25 Tue 14:06 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Git Workflow Step-by-step Guide</title>
<meta name="author" content="Nilesh Suthar" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Git Workflow Step-by-step Guide</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgb506283">1. Workflows</a>
<ul>
<li><a href="#org922b922">1.1. Deployment for UAT Environment</a></li>
<li><a href="#orgc256dcd">1.2. Links</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgb506283" class="outline-2">
<h2 id="orgb506283"><span class="section-number-2">1.</span> Workflows</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org922b922" class="outline-3">
<h3 id="org922b922"><span class="section-number-3">1.1.</span> Deployment for UAT Environment</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Feature branch has been merged/reviewed into develop branch through the github Pull Request
</p>

<p>
for UAT deployment the current develop branch will be merged into uat branch
</p>

<ol class="org-ol">
<li><p>
Create a release branch to start a deployment cylce
</p>

<p>
1.1. Pull changes
</p>
<pre class="example">
git pull upstream develop
</pre>

<p>
1.2. Checkout to uat branch
</p>
<pre class="example">
git checkout develop
</pre>

<p>
1.3. Checkout to the newly created branch
</p>
<pre class="example">
git checkout -b release/&lt;yyyy-mm-dd&gt;
</pre></li>

<li><p>
Release-oriented tasks
</p>

<p>
2.1. Building the source code
</p>
<pre class="example">
npm run build
</pre>
<p>
Above command is configured to create an optimized build of the source to be deployment on the cloud server.
</p>

<p>
2.2. Bug fixes
</p>
<pre class="example">
git add .
git commit -m "fix some bugs"
</pre>

<p>
2.3. Documentation generation
</p>
<pre class="example">
vi path/to/feature/folder/README.md
</pre>
<p>
You can add all the details about the code and it's working. All the functions, their parameters, and output You should example code blocks to show the intended usage. You can add warning and any known issues. This documentation is important for the next developer to continue where you left off.
</p></li>

<li><p>
Once it's ready to ship, the release branch gets merged into uat and tagged with a version number.
</p>

<p>
3.1. We create a tag with date (UAT should not have version and date of deployment should work)
</p>
<pre class="example">
git tag release/&lt;yyyy-mm-dd&gt;
git push --tags upstream
</pre>

<blockquote>
<p>
Once the release is ready to ship, it will get merged it into main and develop, then the release branch will be deleted. It’s important to merge back into develop because critical updates may have been added to the release branch and they need to be accessible to new features. If your organization stresses code review, this would be an ideal place for a pull request.
</p>
</blockquote>

<p>
3.2. In addition, it should be merged back into develop, which may have progressed since the release was initiated.
</p>
<pre class="example">
git checkout uat
git merge release/&lt;yyyy-mm-dd&gt;
</pre></li>
</ol>
</div>
</div>

<div id="outline-container-orgc256dcd" class="outline-3">
<h3 id="orgc256dcd"><span class="section-number-3">1.2.</span> Links</h3>
<div class="outline-text-3" id="text-1-2">
<p>
<a href="https://www.atlassian.com/git/tutorials/comparing-workflows/gitflow-workflow">Git flow tutorial</a>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2024-06-07</p>
<p class="author">Author: Nilesh Suthar</p>
<p class="date">Created: 2024-06-25 Tue 14:06</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
